getafix.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
<head>
<!-- 2019-07-16 Tue 09:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Phil Dyer">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga51c7e1">1. Getafix structure</a>
<ul>
<li><a href="#org29374ca">1.1. Cluster</a></li>
<li><a href="#orge2c8b32">1.2. Node</a></li>
<li><a href="#org2a4b5d1">1.3. Cores and memory</a></li>
<li><a href="#orgfd434cb">1.4. Login Node</a></li>
<li><a href="#org9eef8d9">1.5. SLURM</a></li>
<li><a href="#org9a7bcba">1.6. Other Resources</a></li>
</ul>
</li>
<li><a href="#orge30aa9b">2. Getting into Getafix</a>
<ul>
<li><a href="#org7511106">2.1. Request Access</a></li>
<li><a href="#org0374508">2.2. Network Access</a>
<ul>
<li><a href="#org97e3abb">2.2.1. eduroam/uq cable/uq wifi</a></li>
<li><a href="#org6cddf1e">2.2.2. Everywhere else</a></li>
</ul>
</li>
<li><a href="#orgebef0ec">2.3. The terminal</a></li>
<li><a href="#orgb15c4ad">2.4. Logging into Getafix</a>
<ul>
<li><a href="#orgfe78662">2.4.1. Advanced</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org16ce209">3. Putting your data on Getafix</a>
<ul>
<li><a href="#org5cac40d">3.1. Home, Data</a>
<ul>
<li><a href="#org6151046">3.1.1. Home</a></li>
<li><a href="#orge06921e">3.1.2. Data</a></li>
<li><a href="#org5c7e99c">3.1.3. Data1, Data2 &#x2026; Data6</a></li>
</ul>
</li>
<li><a href="#org07c7c64">3.2. Sending your data there</a>
<ul>
<li><a href="#orga544948">3.2.1. scp</a></li>
<li><a href="#org16dd2ca">3.2.2. WinSCP</a></li>
<li><a href="#org38bb80b">3.2.3. rsync</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge9a803d">4. Running jobs on Getafix</a>
<ul>
<li><a href="#orgd668c8c">4.1. Modules</a></li>
<li><a href="#org1eed2d3">4.2. R on Getafix</a>
<ul>
<li><a href="#orgf1384a5">4.2.1. installing packages</a></li>
<li><a href="#orgbb70efd">4.2.2. Parameters for Rmd files</a></li>
<li><a href="#orgcca1f63">4.2.3. Parameters for script files</a></li>
</ul>
</li>
<li><a href="#org0fe47ec">4.3. SLURM</a>
<ul>
<li><a href="#org98d21fc">4.3.1. <code>sbatch</code></a></li>
<li><a href="#org52065d2">4.3.2. <code>salloc</code> and <code>srun</code></a></li>
<li><a href="#org9ad6ac6">4.3.3. Many nodes</a></li>
<li><a href="#orgec718c0">4.3.4. R with parameters</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgae61a83">5. Debugging Rmd files</a>
<ul>
<li><a href="#orgb324aa8">5.1. Cache on</a></li>
<li><a href="#orge1b4b6f">5.2. Load in cache dir</a></li>
</ul>
</li>
<li><a href="#org3c237b4">6. Getting Results back</a>
<ul>
<li><a href="#org9cae7bf">6.1. Printed text</a></li>
<li><a href="#org6ab4b87">6.2. Data.frames</a></li>
<li><a href="#org867ed36">6.3. Plots</a></li>
</ul>
</li>
<li><a href="#org29c0d13">7. Playing nice</a></li>
<li><a href="#org1e24bba">8. Parallel coding in R</a>
<ul>
<li><a href="#orgc3c7e8d">8.1. <code>parlapply</code>, <code>par*apply</code> etc.</a></li>
<li><a href="#org2ea5b9b">8.2. <code>foreach</code> and <code>%dopar%</code></a></li>
<li><a href="#org648da97">8.3. <code>future</code></a></li>
<li><a href="#org1945e27">8.4. General Coding habits for going parallel</a>
<ul>
<li><a href="#org4a6f02a">8.4.1. Put things into lists</a></li>
<li><a href="#org15554f1">8.4.2. Don't do graphics in parallel</a></li>
<li><a href="#org9afcd0a">8.4.3. Make functions small</a></li>
<li><a href="#org04035db">8.4.4. Look for loops, but don't use R base <code>for</code> loops</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc156655">9. Tricks</a>
<ul>
<li><a href="#org5dce47c">9.1. Don't forget which computer you are looking at</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="http://research.smp.uq.edu.au/computing/getafix.html">http://research.smp.uq.edu.au/computing/getafix.html</a>
</p>
