getafix.org
** Cluster

Getafix is a cluster. 
That means there are many computers all talking to each-other and sharing resources.

The cluster will assign your job to nodes using the SLURM program.

** Node

Each computer in the cluster is called a node. 
Each node has it's own cpu's, memory and graphics card. 
Nodes all share a common network drive, so all your data is available on all the nodes.

** Cores and memory

Most nodes in Getafix have about 24 cores, a few have more and a few have less. 
Each node also typically has about 250GB of memory.

If I can find a list of the nodes, I'll add it for reference.

** Login Node

One node is special, the login node. 
Strictly speaking, Getafix is the login node, which is why Dogmatix, the older SMP cluster, has access to most of the same resources and nodes.
The login node works like any remote computer, you can run jobs on the login node, but out of respect for other users, you should only do setup operations and short tests on the login node.

** SLURM
SLURM is the program that balances all the jobs between users across the cluster.
You specify what you want the cluster to do, and how much time, nodes, cpu's and memory you think you will need.
SLURM then waits until the cluster has enough resources available to run your job and starts the job.
If you try to use more resources than you asked for, your job will be killed.
If you ask for lots of resources, it might take a while for enough nodes to be available, since smaller jobs will usually fill up the available resources as other jobs end.

** Other Resources
The cluster has access to shared resources, particularly shared storage and networking, so your data is available on all the nodes at the same location.
* Getting into Getafix
** Request Access

Email ITS at help@its.uq.edu.au and request access to the SMP cluster which is called Getafix.

This can take a few days. 
Make sure you explain your connection to the School of Maths and Physics.
For HDR students, you will often have both a staff and student account. 
Let ITS know which one you want to use to log in with.

** Network Access
You must be on the UQ intranet to access the servers.
*** eduroam/uq cable/uq wifi
You are already in the intranet.
*** Everywhere else
You will need to install the UQ VPN software and log in. Follow the instructions at:

https://my.uq.edu.au/information-and-services/information-technology/working-remotely/vpn-virtual-private-network

** The terminal
To access Getafix, you will need a terminal program on your computer.

On mac, this is Terminal.

On windows, this is Command Prompt or Windows Powershell (not Windows Powershell ISE). If you don't have an up to date Windows 10 machine, install [[https://www.chiark.greenend.org.uk/~sgtatham/putty/][PuTTy]].

Some people like the Ubuntu app in windows 10, just remember the /mnt/c/ syntax to get to the files on your computer.

** Logging into Getafix

Once you have your terminal open, type:

#+begin_src sh
ssh  <username>@getafix.smp.uq.edu.au
#+end_src

Where ~<username>~ is your staff or student login.

If a popup appears saying ~"Authenticity can't be established"~. Say yes.

Enter your password.

If you see:
 #+begin_quote
 ssh: Could not resolve hostname getafix.smp.uq.edu.au: This is usually a temporary error during hostname resolution and means that the local server did not receive a response from an authoritative server.
 #+end_quote

Then you either typed it incorrectly or are not on the UQ internal network, see [[Network Access]]. 

If you really want R X11 plots to appear on your desktop, add ~-X~ to the login. 
This works on Mac and Linux. Windows may need an X11 server, which you can most easily get from the Ubuntu app.
I strongly recommend saving plots into files and copying them to your computer, X11 can be very slow to render.

#+begin_src sh
ssh -X <username>@getafix.smp.uq.edu.au
#+end_src

*** Advanced 

**** SSH config file

~\~/.ssh/config~:
#+begin_src sh
Host my-getafix
  ForwardX11Trusted yes #equivalent to adding -X
  User uqpdyer
  HostName 130.102.3.59

Host dogmatix
  ForwardX11Trusted yes
  User uqpdyer
  HostName dogmatix.smp.uq.edu.au
 
#+end_src

Now, you only have to type

#+begin_src sh
ssh my-getafix
#+end_src

**** COMMENT SSH keyfiles 

Keyfiles are more secure than username/passwords, but we aren't doing anything particularly sensitive here. I won't put this into the lab documents, because I don't see a use case.


* Putting your data on Getafix
** Home, Data
You need to have your data on Getafix. Where to put it?

#+begin_example
ls /
#+end_example

*** Home
#+begin_example
/home/username/
#+end_example

Which is often shortened to 

#+begin_example
~/
#+end_example

You have 40GB of data allowed in here. 

The home directory is often used for programs and configuration files. 
R libraries will install here by default, which is fine.

Don't use the home directory for data sets, results and plots.

*** Data
#+begin_example
/data/username/
#+end_example

You have 400GB of data allowed in here.

Put your data sets and scripts in the ~/data/username/~ directory.

At some point we may have a shared folder in here, probably ~/data/mathmarecol/~.


*** Data1, Data2 ... Data6
Most of the time you use ~/data/~ but there are other data folders that you can access on request.

#+begin_example
/data1/username/
/data2/username/
...
#+end_example

~data1~ and ~data2~ are older system drives that we are not using.

~data3~ to ~data6~ are high speed access drives for very large file reading and writing.
These could be useful for work on GCM's.

** Sending your data there

