getafix.html

<div id="outline-container-org29374ca" class="outline-3">
<h3 id="org29374ca"><span class="section-number-3">1.1</span> Cluster</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Getafix is a cluster. 
That means there are many computers all talking to each-other and sharing resources.
</p>

<p>
The cluster will assign your job to nodes using the SLURM program.
</p>
</div>
</div>

<div id="outline-container-orge2c8b32" class="outline-3">
<h3 id="orge2c8b32"><span class="section-number-3">1.2</span> Node</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Each computer in the cluster is called a node. 
Each node has it's own cpu's, memory and graphics card. 
Nodes all share a common network drive, so all your data is available on all the nodes.
</p>
</div>
</div>

<div id="outline-container-org2a4b5d1" class="outline-3">
<h3 id="org2a4b5d1"><span class="section-number-3">1.3</span> Cores and memory</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Most nodes in Getafix have about 24 cores, a few have more and a few have less. 
Each node also typically has about 250GB of memory.
</p>

<p>
If I can find a list of the nodes, I'll add it for reference.
</p>
</div>
</div>

<div id="outline-container-orgfd434cb" class="outline-3">
<h3 id="orgfd434cb"><span class="section-number-3">1.4</span> Login Node</h3>
<div class="outline-text-3" id="text-1-4">
<p>
One node is special, the login node. 
Strictly speaking, Getafix is the login node, which is why Dogmatix, the older SMP cluster, has access to most of the same resources and nodes.
The login node works like any remote computer, you can run jobs on the login node, but out of respect for other users, you should only do setup operations and short tests on the login node.
</p>
</div>
</div>

<div id="outline-container-org9eef8d9" class="outline-3">
<h3 id="org9eef8d9"><span class="section-number-3">1.5</span> SLURM</h3>
<div class="outline-text-3" id="text-1-5">
<p>
SLURM is the program that balances all the jobs between users across the cluster.
You specify what you want the cluster to do, and how much time, nodes, cpu's and memory you think you will need.
SLURM then waits until the cluster has enough resources available to run your job and starts the job.
If you try to use more resources than you asked for, your job will be killed.
If you ask for lots of resources, it might take a while for enough nodes to be available, since smaller jobs will usually fill up the available resources as other jobs end.
</p>
</div>
</div>

<div id="outline-container-org9a7bcba" class="outline-3">
<h3 id="org9a7bcba"><span class="section-number-3">1.6</span> Other Resources</h3>
<div class="outline-text-3" id="text-1-6">
<p>
The cluster has access to shared resources, particularly shared storage and networking, so your data is available on all the nodes at the same location.
</p>
</div>
</div>
</div>
<div id="outline-container-orge30aa9b" class="outline-2">
<h2 id="orge30aa9b"><span class="section-number-2">2</span> Getting into Getafix</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7511106" class="outline-3">
<h3 id="org7511106"><span class="section-number-3">2.1</span> Request Access</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Email ITS at help@its.uq.edu.au and request access to the SMP cluster which is called Getafix.
</p>

<p>
This can take a few days. 
Make sure you explain your connection to the School of Maths and Physics.
For HDR students, you will often have both a staff and student account. 
Let ITS know which one you want to use to log in with.
</p>
</div>
</div>

<div id="outline-container-org0374508" class="outline-3">
<h3 id="org0374508"><span class="section-number-3">2.2</span> Network Access</h3>
<div class="outline-text-3" id="text-2-2">
<p>
You must be on the UQ intranet to access the servers.
</p>
</div>
<div id="outline-container-org97e3abb" class="outline-4">
<h4 id="org97e3abb"><span class="section-number-4">2.2.1</span> eduroam/uq cable/uq wifi</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
You are already in the intranet.
</p>
</div>
</div>
<div id="outline-container-org6cddf1e" class="outline-4">
<h4 id="org6cddf1e"><span class="section-number-4">2.2.2</span> Everywhere else</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
You will need to install the UQ VPN software and log in. Follow the instructions at:
</p>

<p>
<a href="https://my.uq.edu.au/information-and-services/information-technology/working-remotely/vpn-virtual-private-network">https://my.uq.edu.au/information-and-services/information-technology/working-remotely/vpn-virtual-private-network</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgebef0ec" class="outline-3">
<h3 id="orgebef0ec"><span class="section-number-3">2.3</span> The terminal</h3>
<div class="outline-text-3" id="text-2-3">
<p>
To access Getafix, you will need a terminal program on your computer.
</p>

<p>
On mac, this is Terminal.
</p>

<p>
On windows, this is Command Prompt or Windows Powershell (not Windows Powershell ISE). If you don't have an up to date Windows 10 machine, install <a href="https://www.chiark.greenend.org.uk/~sgtatham/putty/">PuTTy</a>.
</p>

<p>
Some people like the Ubuntu app in windows 10, just remember the <i>mnt/c</i> syntax to get to the files on your computer.
</p>
</div>
</div>

<div id="outline-container-orgb15c4ad" class="outline-3">
<h3 id="orgb15c4ad"><span class="section-number-3">2.4</span> Logging into Getafix</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Once you have your terminal open, type:
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh  &lt;username&gt;@getafix.smp.uq.edu.au
</pre>
</div>

<p>
Where <code>&lt;username&gt;</code> is your staff or student login.
</p>

<p>
If a popup appears saying <code>"Authenticity can't be established"</code>. Say yes.
</p>

<p>
Enter your password.
</p>

<p>
If you see:
</p>
<blockquote>
<p>
ssh: Could not resolve hostname getafix.smp.uq.edu.au: This is usually a temporary error during hostname resolution and means that the local server did not receive a response from an authoritative server.
</p>
</blockquote>

<p>
Then you either typed it incorrectly or are not on the UQ internal network, see <a href="#org0374508">2.2</a>. 
</p>

<p>
If you really want R X11 plots to appear on your desktop, add <code>-X</code> to the login. 
This works on Mac and Linux. Windows may need an X11 server, which you can most easily get from the Ubuntu app.
I strongly recommend saving plots into files and copying them to your computer, X11 can be very slow to render.
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh -X &lt;username&gt;@getafix.smp.uq.edu.au
</pre>
</div>
</div>

<div id="outline-container-orgfe78662" class="outline-4">
<h4 id="orgfe78662"><span class="section-number-4">2.4.1</span> Advanced</h4>
<div class="outline-text-4" id="text-2-4-1">
</div>
<ol class="org-ol">
<li><a id="org6773cf8"></a>SSH config file<br>
<div class="outline-text-5" id="text-2-4-1-1">
<p>
<code>\~/.ssh/config</code>:
</p>
<div class="org-src-container">
<pre class="src src-sh">Host my-getafix
  ForwardX11Trusted yes <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">equivalent to adding -X</span>
  User uqpdyer
  HostName <span style="color: #4e3163;">130.102.3.59</span>

Host dogmatix
  ForwardX11Trusted yes
  User uqpdyer
  HostName dogmatix.smp.uq.edu.au

</pre>
</div>

<p>
Now, you only have to type
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh my-getafix
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org16ce209" class="outline-2">
<h2 id="org16ce209"><span class="section-number-2">3</span> Putting your data on Getafix</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5cac40d" class="outline-3">
<h3 id="org5cac40d"><span class="section-number-3">3.1</span> Home, Data</h3>
<div class="outline-text-3" id="text-3-1">
<p>
You need to have your data on Getafix. Where to put it?
</p>

<pre class="example">
ls /
</pre>
</div>

<div id="outline-container-org6151046" class="outline-4">
<h4 id="org6151046"><span class="section-number-4">3.1.1</span> Home</h4>
<div class="outline-text-4" id="text-3-1-1">
<pre class="example">
/home/username/
</pre>

<p>
Which is often shortened to 
</p>

<pre class="example">
~/
</pre>

<p>
You have 40GB of data allowed in here. 
</p>

<p>
The home directory is often used for programs and configuration files. 
R libraries will install here by default, which is fine.
</p>

<p>
Don't use the home directory for data sets, results and plots.
</p>
</div>
</div>

<div id="outline-container-orge06921e" class="outline-4">
<h4 id="orge06921e"><span class="section-number-4">3.1.2</span> Data</h4>
<div class="outline-text-4" id="text-3-1-2">
<pre class="example">
/data/username/
</pre>

<p>
You have 400GB of data allowed in here.
</p>

<p>
Put your data sets and scripts in the <code>/data/username/</code> directory.
</p>

<p>
At some point we may have a shared folder in here, probably <code>/data/mathmarecol/</code>.
</p>
</div>
</div>


<div id="outline-container-org5c7e99c" class="outline-4">
<h4 id="org5c7e99c"><span class="section-number-4">3.1.3</span> Data1, Data2 &#x2026; Data6</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Most of the time you use <code>/data/</code> but there are other data folders that you can access on request.
</p>

<pre class="example">
/data1/username/
/data2/username/
...
</pre>

<p>
<code>data1</code> and <code>data2</code> are older system drives that we are not using.
</p>

<p>
<code>data3</code> to <code>data6</code> are high speed access drives for very large file reading and writing.
These could be useful for work on GCM's.
</p>
</div>
</div>
</div>

<div id="outline-container-org07c7c64" class="outline-3">
<h3 id="org07c7c64"><span class="section-number-3">3.2</span> Sending your data there</h3>
<div class="outline-text-3" id="text-3-2">
</div>
