getafix.org
*** scp
scp is copy over ssh, it should work anywhere ssh works.
#+begin_src sh
scp -r  local_folder <username>@getafix.smp.uq.edu.au:/data/<username>/<folder>
#+end_src

*** WinSCP
A graphical interface for scp.

*** rsync
Rsync is smarter than scp, it only copies changes, so it can be faster than scp.

usually installed on Linux, may not be available on Mac or Windows.

#+begin_src sh
rsync  local_folder <username>@getafix.smp.uq.edu.au:/data/<username>/<folder>
#+end_src

* Running jobs on Getafix
** Modules

To allow different versions of software to be used by different users (like python 3.4 versus python 3.6), Getafix uses Linux modules.
On Getafix, R is in a module, and won't work until you load the module.
You can use the default version of a module, or specify a particular version of a module if your job depends on it. 

To see what modules are available, type:

#+begin_src sh
module avail
#+end_src

When you see a module you want to use, load it with:

#+begin_src sh
module load <module name>
#+end_src

I use the following modules:

#+begin_src sh
module load R
module load pandoc #rendering rmarkdown into html and pdf
module load gdal #spatial packages like sf
module load geos #spatial packages like sf
module load proj #spatial packages like sf
#+end_src 


** R on Getafix
R on Getafix is pretty similar to R on your local computer, without RStudio.

*** installing packages
Install packages to a local library in your home directory.

#+begin_src sh
module load R
R
#+end_src

#+begin_src R
install.packages("foreach")
install.packages("doParallel")
install.packages("sf")
#+end_src

Accept the default library location unless you have a reason not to.

If your package fails to install, check if there is a system package missing. 

For example, to install ~sf~, you need to load more modules:
#+begin_src sh
module load R
module load gdal
module load geos
module load proj
R
#+end_src

Now ~sf~ should install.

#+begin_src R
install.packages("sf")
#+end_src

If it still does not work, send an email to help@its.uq.edu.au, they have been helpful setting me up when something was missing or broken.


*** Parameters for Rmd files

You can pass parameters into Rmd files from the command line.
You need to set up the `params` in the YAML header, see [[https://bookdown.org/yihui/rmarkdown/parameterized-reports.html]]

Using Rscript, you can render a report using a specified set of parameters like this:

#+begin_src sh
paramlist='list(nCores =24, gRange = 1:300 )'
Rscript -e 'knitr::opts_knit$set(progress = TRUE, verbose = TRUE); rmarkdown::render("/data/uqpdyer/demo.Rmd", params = '"${paramlist}"', output_format = "html_notebook", output_file = "outfile.html", output_dir = "/data/uqpdyer", envir = new.env())'
#+end_src

This is not as convenient as setting parameters in RStudio or within an R session. 
You have to be very careful about quotes, and the command line is hard to edit.

Sending parameters to an R script in bulk is much easier, but lacks the reproducability of Rmd.

*** Parameters for script files

Use the base ~commandArgs~ or the ~optparse~ package to use command line parameters in your script files


Then you can run the script from the command line like this:

#+begin_src sh
Rscript script.R input1 input2
#+end_src


** SLURM

So far, R has been running on the login node. 
Some things are easiest to do on the login node, like installing packages and transferring files.
Computationally heavy tasks should be done on other nodes.
To use the other nodes, you submit jobs with SLURM.

SLURM is a job scheduler. 
People request jobs by specifying the resources they need and the scripts to run, and SLURM queues the jobs until some nodes are available to run the job.
You can also request an interactive session, but it is more efficient to set up jobs and come back to get the results.

