getafix.html
<div id="outline-container-orga544948" class="outline-4">
<h4 id="orga544948"><span class="section-number-4">3.2.1</span> scp</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
scp is copy over ssh, it should work anywhere ssh works.
</p>
<div class="org-src-container">
<pre class="src src-sh">scp -r  local_folder &lt;username&gt;@getafix.smp.uq.edu.au:/data/&lt;username&gt;/&lt;folder&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org16dd2ca" class="outline-4">
<h4 id="org16dd2ca"><span class="section-number-4">3.2.2</span> WinSCP</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
A graphical interface for scp.
</p>
</div>
</div>

<div id="outline-container-org38bb80b" class="outline-4">
<h4 id="org38bb80b"><span class="section-number-4">3.2.3</span> rsync</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
Rsync is smarter than scp, it only copies changes, so it can be faster than scp.
</p>

<p>
usually installed on Linux, may not be available on Mac or Windows.
</p>

<div class="org-src-container">
<pre class="src src-sh">rsync  local_folder &lt;username&gt;@getafix.smp.uq.edu.au:/data/&lt;username&gt;/&lt;folder&gt;
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orge9a803d" class="outline-2">
<h2 id="orge9a803d"><span class="section-number-2">4</span> Running jobs on Getafix</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd668c8c" class="outline-3">
<h3 id="orgd668c8c"><span class="section-number-3">4.1</span> Modules</h3>
<div class="outline-text-3" id="text-4-1">
<p>
To allow different versions of software to be used by different users (like python 3.4 versus python 3.6), Getafix uses Linux modules.
On Getafix, R is in a module, and won't work until you load the module.
You can use the default version of a module, or specify a particular version of a module if your job depends on it. 
</p>

<p>
To see what modules are available, type:
</p>

<div class="org-src-container">
<pre class="src src-sh">module avail
</pre>
</div>

<p>
When you see a module you want to use, load it with:
</p>

<div class="org-src-container">
<pre class="src src-sh">module load &lt;module name&gt;
</pre>
</div>

<p>
I use the following modules:
</p>

<div class="org-src-container">
<pre class="src src-sh">module load R
module load pandoc <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">rendering rmarkdown into html and pdf</span>
module load gdal <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">spatial packages like sf</span>
module load geos <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">spatial packages like sf</span>
module load proj <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">spatial packages like sf</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org1eed2d3" class="outline-3">
<h3 id="org1eed2d3"><span class="section-number-3">4.2</span> R on Getafix</h3>
<div class="outline-text-3" id="text-4-2">
<p>
R on Getafix is pretty similar to R on your local computer, without RStudio.
</p>
</div>

<div id="outline-container-orgf1384a5" class="outline-4">
<h4 id="orgf1384a5"><span class="section-number-4">4.2.1</span> installing packages</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Install packages to a local library in your home directory.
</p>

<div class="org-src-container">
<pre class="src src-sh">module load R
R
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">install.packages<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"foreach"</span><span style="color: #3a81c3;">)</span>
install.packages<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"doParallel"</span><span style="color: #3a81c3;">)</span>
install.packages<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"sf"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Accept the default library location unless you have a reason not to.
</p>

<p>
If your package fails to install, check if there is a system package missing. 
</p>

<p>
For example, to install <code>sf</code>, you need to load more modules:
</p>
<div class="org-src-container">
<pre class="src src-sh">module load R
module load gdal
module load geos
module load proj
R
</pre>
</div>

<p>
Now <code>sf</code> should install.
</p>

<div class="org-src-container">
<pre class="src src-R">install.packages<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"sf"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
If it still does not work, send an email to help@its.uq.edu.au, they have been helpful setting me up when something was missing or broken.
</p>
</div>
</div>


<div id="outline-container-orgbb70efd" class="outline-4">
<h4 id="orgbb70efd"><span class="section-number-4">4.2.2</span> Parameters for Rmd files</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
You can pass parameters into Rmd files from the command line.
You need to set up the `params` in the YAML header, see <a href="https://bookdown.org/yihui/rmarkdown/parameterized-reports.html">https://bookdown.org/yihui/rmarkdown/parameterized-reports.html</a>
</p>

<p>
Using Rscript, you can render a report using a specified set of parameters like this:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #715ab1;">paramlist</span>=<span style="color: #2d9574;">'list(nCores =24, gRange = 1:300 )'</span>
Rscript -e <span style="color: #2d9574;">'knitr::opts_knit$set(progress = TRUE, verbose = TRUE); rmarkdown::render("/data/uqpdyer/demo.Rmd", params = '"${paramlist}"', output_format = "html_notebook", output_file = "outfile.html", output_dir = "/data/uqpdyer", envir = new.env())'</span>
</pre>
</div>

<p>
This is not as convenient as setting parameters in RStudio or within an R session. 
You have to be very careful about quotes, and the command line is hard to edit.
</p>

<p>
Sending parameters to an R script in bulk is much easier, but lacks the reproducability of Rmd.
</p>
</div>
</div>

<div id="outline-container-orgcca1f63" class="outline-4">
<h4 id="orgcca1f63"><span class="section-number-4">4.2.3</span> Parameters for script files</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
Use the base <code>commandArgs</code> or the <code>optparse</code> package to use command line parameters in your script files
</p>


<p>
Then you can run the script from the command line like this:
</p>

<div class="org-src-container">
<pre class="src src-sh">Rscript script.R input1 input2
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org0fe47ec" class="outline-3">
<h3 id="org0fe47ec"><span class="section-number-3">4.3</span> SLURM</h3>
<div class="outline-text-3" id="text-4-3">
<p>
So far, R has been running on the login node. 
Some things are easiest to do on the login node, like installing packages and transferring files.
Computationally heavy tasks should be done on other nodes.
To use the other nodes, you submit jobs with SLURM.
</p>

<p>
SLURM is a job scheduler. 
People request jobs by specifying the resources they need and the scripts to run, and SLURM queues the jobs until some nodes are available to run the job.
You can also request an interactive session, but it is more efficient to set up jobs and come back to get the results.
</p>
</div>
