getafix.org
*** ~sbatch~
The command ~sbatch~ is used to submit jobs, which are run when the resources become available.

You use SLURM by calling ~sbatch~:
#+begin_src sh
sbatch script.sh
#+end_src

where ~script.sh~ looks like
#+begin_src sh
  #!/bin/bash
  #SBATCH --ntasks=1
  #SBATCH --cpus-per-task=1
  #SBATCH --mem-per-cpu=1G
  #SBATCH --time=0-00:10

  echo "hello world"
#+end_src

The ~#SBATCH~ lines at the top are parameters for the sbatch command, you can also include them in the command call:


#+begin_src sh
  sbatch script.sh --ntasks=1 --cpus-per-task=1 --mem-per-cpu=1G --time=0-00:10 script.sh
#+end_src

Then ~script.sh~ can simplify down to:

#+begin_src sh
  #!/bin/bash

  echo "hello world"
#+end_src

When working with R, we run scripts or arbitrary code snippets with Rscript, but the ~sbatch~ command still expects Rscript to be wrapped in ~script_for_r.sh~

#+begin_src shell
  #!/bin/bash
  #SBATCH --ntasks=1
  #SBATCH --cpus-per-task=20
  #SBATCH --mem-per-cpu=2G
  #SBATCH --time=0-01:00

  module load R
  Rscript myRscript.R
#+end_src

So running ~sbatch~ looks the same:

#+begin_src sh
sbatch script_for_r.sh
#+end_src

Here is a meaningful r script we can test out. Note that I have specified 20 cpu's in both ~script_for_r.sh~ and ~myRscript.R~ 

#+begin_src R
library(foreach)
library(doParallel)

cl <- makeCluster(2)
registerDoParallel(cl)
x <- iris[which(iris[,5] != "setosa"), c(1,5)]
trials <- 10000

ptime <- system.time({
  r <- ~foreach~(icount(trials), .combine=cbind) %dopar% {
    ind <- sample(100, 100, replace=TRUE)
    result1 <- glm(x[ind,2]~x[ind,1], family=binomial(logit))
    coefficients(result1)
  }
})[3]
ptime


stime <- system.time({
  r <- ~foreach~(icount(trials), .combine=cbind) %do% {
    ind <- sample(100, 100, replace=TRUE)
    result1 <- glm(x[ind,2]~x[ind,1], family=binomial(logit))
    coefficients(result1)
  }
})[3]
stime

stopCluster(cl)

cl <- makeCluster(20)
registerDoParallel(cl)
ptime <- system.time({
  r <- ~foreach~(icount(trials), .combine=cbind) %dopar% {
    ind <- sample(100, 100, replace=TRUE)
    result1 <- glm(x[ind,2]~x[ind,1], family=binomial(logit))
    coefficients(result1)
  }
})[3]
ptime

#+end_src



*** ~salloc~ and ~srun~

If you really need to run something interactively, such as a Matlab GUI, make sure you log in with ~-X~ or ~-Y~ and then call:

#+begin_src 1
 salloc --ntasks=1 --cpus-per-task=1 --mem-per-cpu=1G --time=0-00:10 
 srun --pty -x11 matlab
#+end_src

*** Many nodes

So far, we have used only 1 node. 
The memory and cpu's are all in the same node, and R behaves in exactly the same way as on your machine, only with more cores.
You are clearly limited to a speed up of around 20 times with a single node.

To go beyond the single node limit, you have a few options.

**** Divide your job up
If you can break your job up into many independent runs, then you can submit a job for each run, and collect all the different outputs after all the jobs have run.

I have done this to test out the effects of changing combinations of parameters.

**** Rslurm

The Rslurm package will generate a set of scripts that submit a collection of jobs.
Rslurm does the work of dividing up your job for you.

Take care with this package, the default settings will allocate far too many jobs and overwhelm Getafix.

