getafix.html

<div id="outline-container-org98d21fc" class="outline-4">
<h4 id="org98d21fc"><span class="section-number-4">4.3.1</span> <code>sbatch</code></h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
The command <code>sbatch</code> is used to submit jobs, which are run when the resources become available.
</p>

<p>
You use SLURM by calling <code>sbatch</code>:
</p>
<div class="org-src-container">
<pre class="src src-sh">sbatch script.sh
</pre>
</div>

<p>
where <code>script.sh</code> looks like
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/</span><span style="color: #3a81c3; font-weight: bold;">bash</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --ntasks=1</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --cpus-per-task=1</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --mem-per-cpu=1G</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --time=0-00:10</span>

<span style="color: #3a81c3;">echo</span> <span style="color: #2d9574;">"hello world"</span>
</pre>
</div>

<p>
The <code>#SBATCH</code> lines at the top are parameters for the sbatch command, you can also include them in the command call:
</p>


<div class="org-src-container">
<pre class="src src-sh">sbatch script.sh --ntasks=<span style="color: #4e3163;">1</span> --cpus-per-task=<span style="color: #4e3163;">1</span> --mem-per-cpu=<span style="color: #4e3163;">1G</span> --time=<span style="color: #4e3163;">0-00:10</span> script.sh
</pre>
</div>

<p>
Then <code>script.sh</code> can simplify down to:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/</span><span style="color: #3a81c3; font-weight: bold;">bash</span>

<span style="color: #3a81c3;">echo</span> <span style="color: #2d9574;">"hello world"</span>
</pre>
</div>

<p>
When working with R, we run scripts or arbitrary code snippets with Rscript, but the <code>sbatch</code> command still expects Rscript to be wrapped in <code>script_for_r.sh</code>
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/</span><span style="color: #3a81c3; font-weight: bold;">bash</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --ntasks=1</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --cpus-per-task=20</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --mem-per-cpu=2G</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --time=0-01:00</span>

module load R
Rscript myRscript.R
</pre>
</div>

<p>
So running <code>sbatch</code> looks the same:
</p>

<div class="org-src-container">
<pre class="src src-sh">sbatch script_for_r.sh
</pre>
</div>

<p>
Here is a meaningful r script we can test out. Note that I have specified 20 cpu's in both <code>script_for_r.sh</code> and <code>myRscript.R</code> 
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #3a81c3;">library</span><span style="color: #3a81c3;">(</span>foreach<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">library</span><span style="color: #3a81c3;">(</span>doParallel<span style="color: #3a81c3;">)</span>

cl <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> makeCluster<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">2</span><span style="color: #3a81c3;">)</span>
registerDoParallel<span style="color: #3a81c3;">(</span>cl<span style="color: #3a81c3;">)</span>
x <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> iris<span style="color: #3a81c3;">[</span>which<span style="color: #6c3163;">(</span>iris<span style="color: #2d9574;">[</span>,<span style="color: #4e3163;">5</span><span style="color: #2d9574;">]</span> != <span style="color: #2d9574;">"setosa"</span><span style="color: #6c3163;">)</span>, c<span style="color: #6c3163;">(</span><span style="color: #4e3163;">1</span>,<span style="color: #4e3163;">5</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">]</span>
trials <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> <span style="color: #4e3163;">10000</span>

ptime <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> system.time<span style="color: #3a81c3;">(</span><span style="color: #6c3163;">{</span>
  r <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> ~foreach~<span style="color: #2d9574;">(</span>icount<span style="color: #67b11d;">(</span>trials<span style="color: #67b11d;">)</span>, .combine=cbind<span style="color: #2d9574;">)</span> <span style="color: #715ab1;">%dopar%</span> <span style="color: #2d9574;">{</span>
    ind <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> sample<span style="color: #67b11d;">(</span><span style="color: #4e3163;">100</span>, <span style="color: #4e3163;">100</span>, replace=<span style="color: #4e3163;">TRUE</span><span style="color: #67b11d;">)</span>
    result1 <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> glm<span style="color: #67b11d;">(</span>x<span style="color: #b1951d;">[</span>ind,<span style="color: #4e3163;">2</span><span style="color: #b1951d;">]</span>~x<span style="color: #b1951d;">[</span>ind,<span style="color: #4e3163;">1</span><span style="color: #b1951d;">]</span>, family=binomial<span style="color: #b1951d;">(</span>logit<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
    coefficients<span style="color: #67b11d;">(</span>result1<span style="color: #67b11d;">)</span>
  <span style="color: #2d9574;">}</span>
<span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)[</span><span style="color: #4e3163;">3</span><span style="color: #3a81c3;">]</span>
ptime


stime <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> system.time<span style="color: #3a81c3;">(</span><span style="color: #6c3163;">{</span>
  r <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> ~foreach~<span style="color: #2d9574;">(</span>icount<span style="color: #67b11d;">(</span>trials<span style="color: #67b11d;">)</span>, .combine=cbind<span style="color: #2d9574;">)</span> <span style="color: #715ab1;">%do%</span> <span style="color: #2d9574;">{</span>
    ind <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> sample<span style="color: #67b11d;">(</span><span style="color: #4e3163;">100</span>, <span style="color: #4e3163;">100</span>, replace=<span style="color: #4e3163;">TRUE</span><span style="color: #67b11d;">)</span>
    result1 <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> glm<span style="color: #67b11d;">(</span>x<span style="color: #b1951d;">[</span>ind,<span style="color: #4e3163;">2</span><span style="color: #b1951d;">]</span>~x<span style="color: #b1951d;">[</span>ind,<span style="color: #4e3163;">1</span><span style="color: #b1951d;">]</span>, family=binomial<span style="color: #b1951d;">(</span>logit<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
    coefficients<span style="color: #67b11d;">(</span>result1<span style="color: #67b11d;">)</span>
  <span style="color: #2d9574;">}</span>
<span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)[</span><span style="color: #4e3163;">3</span><span style="color: #3a81c3;">]</span>
stime

stopCluster<span style="color: #3a81c3;">(</span>cl<span style="color: #3a81c3;">)</span>

cl <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> makeCluster<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">20</span><span style="color: #3a81c3;">)</span>
registerDoParallel<span style="color: #3a81c3;">(</span>cl<span style="color: #3a81c3;">)</span>
ptime <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> system.time<span style="color: #3a81c3;">(</span><span style="color: #6c3163;">{</span>
  r <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> ~foreach~<span style="color: #2d9574;">(</span>icount<span style="color: #67b11d;">(</span>trials<span style="color: #67b11d;">)</span>, .combine=cbind<span style="color: #2d9574;">)</span> <span style="color: #715ab1;">%dopar%</span> <span style="color: #2d9574;">{</span>
    ind <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> sample<span style="color: #67b11d;">(</span><span style="color: #4e3163;">100</span>, <span style="color: #4e3163;">100</span>, replace=<span style="color: #4e3163;">TRUE</span><span style="color: #67b11d;">)</span>
    result1 <span style="color: #ba2f59; font-weight: bold;">&lt;-</span> glm<span style="color: #67b11d;">(</span>x<span style="color: #b1951d;">[</span>ind,<span style="color: #4e3163;">2</span><span style="color: #b1951d;">]</span>~x<span style="color: #b1951d;">[</span>ind,<span style="color: #4e3163;">1</span><span style="color: #b1951d;">]</span>, family=binomial<span style="color: #b1951d;">(</span>logit<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
    coefficients<span style="color: #67b11d;">(</span>result1<span style="color: #67b11d;">)</span>
  <span style="color: #2d9574;">}</span>
<span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)[</span><span style="color: #4e3163;">3</span><span style="color: #3a81c3;">]</span>
ptime

</pre>
</div>
</div>
</div>



<div id="outline-container-org52065d2" class="outline-4">
<h4 id="org52065d2"><span class="section-number-4">4.3.2</span> <code>salloc</code> and <code>srun</code></h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
If you really need to run something interactively, such as a Matlab GUI, make sure you log in with <code>-X</code> or <code>-Y</code> and then call:
</p>

<div class="org-src-container">
<pre class="src src-1">salloc --ntasks=1 --cpus-per-task=1 --mem-per-cpu=1G --time=0-00:10 
srun --pty -x11 matlab
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ad6ac6" class="outline-4">
<h4 id="org9ad6ac6"><span class="section-number-4">4.3.3</span> Many nodes</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>
So far, we have used only 1 node. 
The memory and cpu's are all in the same node, and R behaves in exactly the same way as on your machine, only with more cores.
You are clearly limited to a speed up of around 20 times with a single node.
</p>

<p>
To go beyond the single node limit, you have a few options.
</p>
</div>

<ol class="org-ol">
<li><a id="orgf9f18d6"></a>Divide your job up<br>
<div class="outline-text-5" id="text-4-3-3-1">
<p>
If you can break your job up into many independent runs, then you can submit a job for each run, and collect all the different outputs after all the jobs have run.
</p>

<p>
I have done this to test out the effects of changing combinations of parameters.
</p>
</div>
</li>

<li><a id="orgfc3df42"></a>Rslurm<br>
<div class="outline-text-5" id="text-4-3-3-2">
<p>
The Rslurm package will generate a set of scripts that submit a collection of jobs.
Rslurm does the work of dividing up your job for you.
</p>

<p>
Take care with this package, the default settings will allocate far too many jobs and overwhelm Getafix.
</p>
</div>
</li>
