getafix.org
**** MPI
Message Passing Interface (MPI) is a library that shares information across nodes.

MPI requires extra setup in your code, and you need to use ~mpirun~ or ~srun~ inside the sbatch script

#+begin_src sh
  #!/bin/bash
  #SBATCH --ntasks=1
  #SBATCH --cpus-per-task=1
  #SBATCH --mem-per-cpu=1G
  #SBATCH --time=0-00:10

  mpirun echo "running with MPI"
  srun echo "run with SRUN"
#+end_src

doMPI and Rmpi are packages for working with MPI in R.

TODO: I have not figured out MPI on the cluster yet, it didn't "just work"

**** future.batchTools

The future.batchtools package lets you submit SLURM jobs from R.
The benefit of using future.batchtools is that you write R code using future syntax, then specify a SLURM plan, and all futures at a level specified by the plan are sent off as jobs. 
The script waits until the job finishes. 

I recommend running a single node task with 1 cpu and a modest amount of ram, but a long running time, then all the heavy lifting is done by new jobs submitted by your script.

Take care with this package, I haven't checked the defaults, but it might request too many resources like Rslurm.

*** R with parameters
Being able to pass in parameters is useful for dividing your job up.

Some examples of sbatch scripts that use R parameters

#+begin_src sh
  #!/bin/bash
  #SBATCH --ntasks=1
  #SBATCH --cpus-per-task=24
  #SBATCH --mem-per-cpu=7G
  #SBATCH --time=1-22:00
  module load R
  Rscript script.R $1 $2
#+end_src

#+begin_src 
sbatch run_script.sh input1 input2
sbatch run_script.sh input1 input3
#+end_src

~$1~ becomes the first argument, ~input1~ both times, and ~$2~ becomes the second argument, ~input2~ in the first run and ~input3~ in the second line.

Rendering an Rmd file with parameters:

#+begin_src sh
#!/bin/bash
#SBATCH --ntasks=1
#SBATCH --cpus-per-task=24
#SBATCH --mem-per-cpu=7G
#SBATCH --time=1-22:00
module load R
module load pandoc #essential for knitr and rmarkdown

paramlist='list(nCores =24, gRange = 1:300 )'
Rscript -e 'knitr::opts_knit$set(progress = TRUE, verbose = TRUE); rmarkdown::render("/data/uqpdyer/demo.Rmd", params = '"${paramlist}"', output_format = "html_notebook", output_file = "outfile.html", output_dir = "/data/uqpdyer", envir = new.env())'

#+end_src

If you want to generate a collection of rendered Rmd files, you have to write up a script for each set of parameters.

The other way to generate a set of Rmd files with different parameters, in parallel, is to copy the file and change the parameters in each file.
Then you can use job arrays by naming the files from 1 to n.

The simplest approach I can think of to run many different Rmd files is to have a shell script, that calls an R script, that renders an Rmd. 
Parameters passed to the shell script go all the way down to the Rmd file.

#+begin_src R
  args = commandArgs(trailingOnly = TRUE)

  knitr::opts_knit$set(progress = TRUE, verbose = TRUE)

  paramlist=list(nCores =as.numeric(args[1]), gRange = as.numeric(args[2]):as.numeric(args[3]))
  rmarkdown::render("/data/uqpdyer/demo.Rmd", params = paramlist, output_format = "html_notebook",
                    output_file = "outfile.html", output_dir = "/data/uqpdyer", envir = new.env())


#+end_src

* Debugging Rmd files
Debugging regular R isn't great, but debugging Rmd files non-interactively is even worse.

Here are some tricks:

** Cache on
Turn on caching for your Rmd file.
#+begin_example
```{r caching_on}
knitr::opts_chunk$set(cache=TRUE)
```
#+end_example


** Load in cache dir

The qwraps2 package on github has a function, ~lazyload_cache~, which will pull in the saved cache so you can interact with it in RStudio.

https://github.com/dewittpe/qwraps2/blob/master/R/lazyload_cache.R

Once you call ~lazyload_cache()~ on the cache generated by knitr, your environment has all the variables seen up until a failure point.

* Getting Results back
The batch jobs are not interactive. 
You set them up to run and come back for the results. 
Usually you save a file to disk.

** Printed text

All printed output goes to a file ~slurm-<job number>.out~.

You can change the name with 
#+begin_src sh
#!/bin/bash
#SBATCH -o output_file_%A_%a.out #%A is the job number, %a is the array number
#SBATCH -e error_file.err
...
#+end_src
** Data.frames

If you have R objects you want to see, save them to disk.

- saveRDS :: R binary format, single object, you specify the name when you readRDS
- fwrite :: data.table csv writer, fast, and gives you a csv
- feather :: a new binary format backed by Hadley, fast, and compatible with python
- fst :: another new binary format, extremely fast and you can read in subsets of the data.frame
- Archivist :: puts everything into a database and gives a unique hash to every object. Good for reproducibility, you can't mix up objects from different runs later on because the hash always changes
