getafix.html

<li><a id="orgbebfe76"></a>MPI<br>
<div class="outline-text-5" id="text-4-3-3-3">
<p>
Message Passing Interface (MPI) is a library that shares information across nodes.
</p>

<p>
MPI requires extra setup in your code, and you need to use <code>mpirun</code> or <code>srun</code> inside the sbatch script
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/</span><span style="color: #3a81c3; font-weight: bold;">bash</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --ntasks=1</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --cpus-per-task=1</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --mem-per-cpu=1G</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --time=0-00:10</span>

mpirun echo <span style="color: #2d9574;">"running with MPI"</span>
srun echo <span style="color: #2d9574;">"run with SRUN"</span>
</pre>
</div>

<p>
doMPI and Rmpi are packages for working with MPI in R.
</p>

<p>
TODO: I have not figured out MPI on the cluster yet, it didn't "just work"
</p>
</div>
</li>

<li><a id="org97d954f"></a>future.batchTools<br>
<div class="outline-text-5" id="text-4-3-3-4">
<p>
The future.batchtools package lets you submit SLURM jobs from R.
The benefit of using future.batchtools is that you write R code using future syntax, then specify a SLURM plan, and all futures at a level specified by the plan are sent off as jobs. 
The script waits until the job finishes. 
</p>

<p>
I recommend running a single node task with 1 cpu and a modest amount of ram, but a long running time, then all the heavy lifting is done by new jobs submitted by your script.
</p>

<p>
Take care with this package, I haven't checked the defaults, but it might request too many resources like Rslurm.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgec718c0" class="outline-4">
<h4 id="orgec718c0"><span class="section-number-4">4.3.4</span> R with parameters</h4>
<div class="outline-text-4" id="text-4-3-4">
<p>
Being able to pass in parameters is useful for dividing your job up.
</p>

<p>
Some examples of sbatch scripts that use R parameters
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/</span><span style="color: #3a81c3; font-weight: bold;">bash</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --ntasks=1</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --cpus-per-task=24</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --mem-per-cpu=7G</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --time=1-22:00</span>
module load R
Rscript script.R $<span style="color: #4e3163;">1</span> $<span style="color: #4e3163;">2</span>
</pre>
</div>

<pre class="example">
sbatch run_script.sh input1 input2
sbatch run_script.sh input1 input3
</pre>

<p>
<code>$1</code> becomes the first argument, <code>input1</code> both times, and <code>$2</code> becomes the second argument, <code>input2</code> in the first run and <code>input3</code> in the second line.
</p>

<p>
Rendering an Rmd file with parameters:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/</span><span style="color: #3a81c3; font-weight: bold;">bash</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --ntasks=1</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --cpus-per-task=24</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --mem-per-cpu=7G</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH --time=1-22:00</span>
module load R
module load pandoc <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">essential for knitr and rmarkdown</span>

<span style="color: #715ab1;">paramlist</span>=<span style="color: #2d9574;">'list(nCores =24, gRange = 1:300 )'</span>
Rscript -e <span style="color: #2d9574;">'knitr::opts_knit$set(progress = TRUE, verbose = TRUE); rmarkdown::render("/data/uqpdyer/demo.Rmd", params = '"${paramlist}"', output_format = "html_notebook", output_file = "outfile.html", output_dir = "/data/uqpdyer", envir = new.env())'</span>

</pre>
</div>

<p>
If you want to generate a collection of rendered Rmd files, you have to write up a script for each set of parameters.
</p>

<p>
The other way to generate a set of Rmd files with different parameters, in parallel, is to copy the file and change the parameters in each file.
Then you can use job arrays by naming the files from 1 to n.
</p>

<p>
The simplest approach I can think of to run many different Rmd files is to have a shell script, that calls an R script, that renders an Rmd. 
Parameters passed to the shell script go all the way down to the Rmd file.
</p>

<div class="org-src-container">
<pre class="src src-R">args = commandArgs<span style="color: #3a81c3;">(</span>trailingOnly = <span style="color: #4e3163;">TRUE</span><span style="color: #3a81c3;">)</span>

knitr::opts_knit$set<span style="color: #3a81c3;">(</span>progress = <span style="color: #4e3163;">TRUE</span>, verbose = <span style="color: #4e3163;">TRUE</span><span style="color: #3a81c3;">)</span>

paramlist=list<span style="color: #3a81c3;">(</span>nCores =as.numeric<span style="color: #6c3163;">(</span>args<span style="color: #2d9574;">[</span><span style="color: #4e3163;">1</span><span style="color: #2d9574;">]</span><span style="color: #6c3163;">)</span>, gRange = as.numeric<span style="color: #6c3163;">(</span>args<span style="color: #2d9574;">[</span><span style="color: #4e3163;">2</span><span style="color: #2d9574;">]</span><span style="color: #6c3163;">)</span>:as.numeric<span style="color: #6c3163;">(</span>args<span style="color: #2d9574;">[</span><span style="color: #4e3163;">3</span><span style="color: #2d9574;">]</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
rmarkdown::render<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"/data/uqpdyer/demo.Rmd"</span>, params = paramlist, output_format = <span style="color: #2d9574;">"html_notebook"</span>,
                  output_file = <span style="color: #2d9574;">"outfile.html"</span>, output_dir = <span style="color: #2d9574;">"/data/uqpdyer"</span>, envir = new.env<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>


</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgae61a83" class="outline-2">
<h2 id="orgae61a83"><span class="section-number-2">5</span> Debugging Rmd files</h2>
<div class="outline-text-2" id="text-5">
<p>
Debugging regular R isn't great, but debugging Rmd files non-interactively is even worse.
</p>

<p>
Here are some tricks:
</p>
</div>

<div id="outline-container-orgb324aa8" class="outline-3">
<h3 id="orgb324aa8"><span class="section-number-3">5.1</span> Cache on</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Turn on caching for your Rmd file.
</p>
<pre class="example">
```{r caching_on}
knitr::opts_chunk$set(cache=TRUE)
```
</pre>
</div>
</div>


<div id="outline-container-orge1b4b6f" class="outline-3">
<h3 id="orge1b4b6f"><span class="section-number-3">5.2</span> Load in cache dir</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The qwraps2 package on github has a function, <code>lazyload_cache</code>, which will pull in the saved cache so you can interact with it in RStudio.
</p>

<p>
<a href="https://github.com/dewittpe/qwraps2/blob/master/R/lazyload_cache.R">https://github.com/dewittpe/qwraps2/blob/master/R/lazyload_cache.R</a>
</p>

<p>
Once you call <code>lazyload_cache()</code> on the cache generated by knitr, your environment has all the variables seen up until a failure point.
</p>
</div>
</div>
</div>

<div id="outline-container-org3c237b4" class="outline-2">
<h2 id="org3c237b4"><span class="section-number-2">6</span> Getting Results back</h2>
<div class="outline-text-2" id="text-6">
<p>
The batch jobs are not interactive. 
You set them up to run and come back for the results. 
Usually you save a file to disk.
</p>
</div>

<div id="outline-container-org9cae7bf" class="outline-3">
<h3 id="org9cae7bf"><span class="section-number-3">6.1</span> Printed text</h3>
<div class="outline-text-3" id="text-6-1">
<p>
All printed output goes to a file <code>slurm-&lt;job number&gt;.out</code>.
</p>

<p>
You can change the name with 
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/</span><span style="color: #3a81c3; font-weight: bold;">bash</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH -o output_file_%A_%a.out #%A is the job number, %a is the array number</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">SBATCH -e error_file.err</span>
...
</pre>
</div>
</div>
</div>
<div id="outline-container-org6ab4b87" class="outline-3">
<h3 id="org6ab4b87"><span class="section-number-3">6.2</span> Data.frames</h3>
<div class="outline-text-3" id="text-6-2">
<p>
If you have R objects you want to see, save them to disk.
</p>

<dl class="org-dl">
<dt>saveRDS</dt><dd>R binary format, single object, you specify the name when you readRDS</dd>
<dt>fwrite</dt><dd>data.table csv writer, fast, and gives you a csv</dd>
<dt>feather</dt><dd>a new binary format backed by Hadley, fast, and compatible with python</dd>
<dt>fst</dt><dd>another new binary format, extremely fast and you can read in subsets of the data.frame</dd>
<dt>Archivist</dt><dd>puts everything into a database and gives a unique hash to every object. Good for reproducibility, you can't mix up objects from different runs later on because the hash always changes</dd>
</dl>
</div>
</div>
