getafix.org
** Plots
Always save plots to disk, unless you are using Rmd files, which will put the plot into the output html anyway.

Use ~ggsave()~ for ggplots, and ~dev.png()~, your plotting code, ~dev.off()~ for other kinds of R plots.

It is a good idea to set the width, height and dpi for all your plots. 

* Playing nice
The cluster is a shared resource. 

Try to be as precise as possible when allocating resources, so others can use what you don't need.

Be careful with any package that submits jobs for you (~Rslurm~, ~future.batchtools~). Check the jobs are requesting a reasonable set of resources.

* Parallel coding in R

** ~parlapply~, ~par*apply~ etc.

The parallel package gives you par* versions of the apply family of functions.

Easy to drop in if you usually use the apply family from base R, you replace any ~apply~, ~lapply~, ~sapply~ with ~parapply~, ~parlapply~, ~parsapply~. 
** ~foreach~ and ~%dopar%~

The ~foreach~ package has a few uses. 

First, it changes how you use ~for~ loops in R. 
Base R ~for~ loops usually work by changing a variable defined outside the loop.
~foreach~ is more like an ~apply~, where a result is returned, so ~foreach~ works without needing to use side effects.

Second, because ~foreach~ can work without side effects, it can run the loop in parallel easily.
There are a number of backends you can use, including ~doParallel~, ~doMPI~, ~doFuture~.
You can quickly change how parallel works by replacing ~%do%~ with ~%dopar%~ and changing the registerDo* function at the start of your script.

If you already like using ~foreach~ over the apply family, moving to parallel is easy. 
The main downside is that ~foreach~ is not particularly efficient with resources.
If you are mostly using the apply family, switching to ~foreach~ is much harder.

** ~future~
The ~future~ package is built around the idea of a promise. 
The promise is "Eventually the variable will have a result assigned to it, but not straight away".
You replace ~<-~ with ~%<-%~ and the line of code becomes a promise, rather than something to do right away.

Generally, you don't need to change your code much, just add ~%~ around your ~<-~ at strategic points, but you can gain a lot of flexibility, and there are many backends.

~future.apply~ gives you parallel versions of ~apply~. 
~doFuture~ mixes ~future~ and ~foreach~.

~future.batchtools~ spawns jobs on the cluster that return the results into your session.
~future.callr~ does local parallel calculations in separate R processes.
~future~ alone will do local multiprocessor calculations and use multiple nodes.


** General Coding habits for going parallel
*** Put things into lists
It is easy to loop over lists, and you can quickly parallelise the processing of a list.
*** Don't do graphics in parallel
Generally speaking, you can specify ggplot objects in parallel, but if you try to print or save them in parallel, R crashes.

You probably have to work very carefully to open multiple ~dev.png()~  for plotting base R plots.

*** Make functions small
If you repeat something frequently, put it into a function. 
You can then put functions into packages.
Try to keep functions small, then they are easier to use in parallel. 
Generally don't try to work in parallel within a function.

If you want a function to use parallel processing, I strongly recommend you use either ~future~ or ~foreach~ with ~%dopar%~.
By default, they both drop back to sequential processing, but the user can set up parallel processing before calling the function to get speed improvements.

*** Look for loops, but don't use R base ~for~ loops
Base R ~for~ loops cannot be used in parallel, because they rely on side effects.



* Tricks 

** Don't forget which computer you are looking at

