getafix.html
<div id="outline-container-org867ed36" class="outline-3">
<h3 id="org867ed36"><span class="section-number-3">6.3</span> Plots</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Always save plots to disk, unless you are using Rmd files, which will put the plot into the output html anyway.
</p>

<p>
Use <code>ggsave()</code> for ggplots, and <code>dev.png()</code>, your plotting code, <code>dev.off()</code> for other kinds of R plots.
</p>

<p>
It is a good idea to set the width, height and dpi for all your plots. 
</p>
</div>
</div>
</div>

<div id="outline-container-org29c0d13" class="outline-2">
<h2 id="org29c0d13"><span class="section-number-2">7</span> Playing nice</h2>
<div class="outline-text-2" id="text-7">
<p>
The cluster is a shared resource. 
</p>

<p>
Try to be as precise as possible when allocating resources, so others can use what you don't need.
</p>

<p>
Be careful with any package that submits jobs for you (<code>Rslurm</code>, <code>future.batchtools</code>). Check the jobs are requesting a reasonable set of resources.
</p>
</div>
</div>

<div id="outline-container-org1e24bba" class="outline-2">
<h2 id="org1e24bba"><span class="section-number-2">8</span> Parallel coding in R</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgc3c7e8d" class="outline-3">
<h3 id="orgc3c7e8d"><span class="section-number-3">8.1</span> <code>parlapply</code>, <code>par*apply</code> etc.</h3>
<div class="outline-text-3" id="text-8-1">
<p>
The parallel package gives you par* versions of the apply family of functions.
</p>

<p>
Easy to drop in if you usually use the apply family from base R, you replace any <code>apply</code>, <code>lapply</code>, <code>sapply</code> with <code>parapply</code>, <code>parlapply</code>, <code>parsapply</code>. 
</p>
</div>
</div>
<div id="outline-container-org2ea5b9b" class="outline-3">
<h3 id="org2ea5b9b"><span class="section-number-3">8.2</span> <code>foreach</code> and <code>%dopar%</code></h3>
<div class="outline-text-3" id="text-8-2">
<p>
The <code>foreach</code> package has a few uses. 
</p>

<p>
First, it changes how you use <code>for</code> loops in R. 
Base R <code>for</code> loops usually work by changing a variable defined outside the loop.
<code>foreach</code> is more like an <code>apply</code>, where a result is returned, so <code>foreach</code> works without needing to use side effects.
</p>

<p>
Second, because <code>foreach</code> can work without side effects, it can run the loop in parallel easily.
There are a number of backends you can use, including <code>doParallel</code>, <code>doMPI</code>, <code>doFuture</code>.
You can quickly change how parallel works by replacing <code>%do%</code> with <code>%dopar%</code> and changing the registerDo* function at the start of your script.
</p>

<p>
If you already like using <code>foreach</code> over the apply family, moving to parallel is easy. 
The main downside is that <code>foreach</code> is not particularly efficient with resources.
If you are mostly using the apply family, switching to <code>foreach</code> is much harder.
</p>
</div>
</div>

<div id="outline-container-org648da97" class="outline-3">
<h3 id="org648da97"><span class="section-number-3">8.3</span> <code>future</code></h3>
<div class="outline-text-3" id="text-8-3">
<p>
The <code>future</code> package is built around the idea of a promise. 
The promise is "Eventually the variable will have a result assigned to it, but not straight away".
You replace <code>&lt;-</code> with <code>%&lt;-%</code> and the line of code becomes a promise, rather than something to do right away.
</p>

<p>
Generally, you don't need to change your code much, just add <code>%</code> around your <code>&lt;-</code> at strategic points, but you can gain a lot of flexibility, and there are many backends.
</p>

<p>
<code>future.apply</code> gives you parallel versions of <code>apply</code>. 
<code>doFuture</code> mixes <code>future</code> and <code>foreach</code>.
</p>

<p>
<code>future.batchtools</code> spawns jobs on the cluster that return the results into your session.
<code>future.callr</code> does local parallel calculations in separate R processes.
<code>future</code> alone will do local multiprocessor calculations and use multiple nodes.
</p>
</div>
</div>


<div id="outline-container-org1945e27" class="outline-3">
<h3 id="org1945e27"><span class="section-number-3">8.4</span> General Coding habits for going parallel</h3>
<div class="outline-text-3" id="text-8-4">
</div>
<div id="outline-container-org4a6f02a" class="outline-4">
<h4 id="org4a6f02a"><span class="section-number-4">8.4.1</span> Put things into lists</h4>
<div class="outline-text-4" id="text-8-4-1">
<p>
It is easy to loop over lists, and you can quickly parallelise the processing of a list.
</p>
</div>
</div>
<div id="outline-container-org15554f1" class="outline-4">
<h4 id="org15554f1"><span class="section-number-4">8.4.2</span> Don't do graphics in parallel</h4>
<div class="outline-text-4" id="text-8-4-2">
<p>
Generally speaking, you can specify ggplot objects in parallel, but if you try to print or save them in parallel, R crashes.
</p>

<p>
You probably have to work very carefully to open multiple <code>dev.png()</code>  for plotting base R plots.
</p>
</div>
</div>

<div id="outline-container-org9afcd0a" class="outline-4">
<h4 id="org9afcd0a"><span class="section-number-4">8.4.3</span> Make functions small</h4>
<div class="outline-text-4" id="text-8-4-3">
<p>
If you repeat something frequently, put it into a function. 
You can then put functions into packages.
Try to keep functions small, then they are easier to use in parallel. 
Generally don't try to work in parallel within a function.
</p>

<p>
If you want a function to use parallel processing, I strongly recommend you use either <code>future</code> or <code>foreach</code> with <code>%dopar%</code>.
By default, they both drop back to sequential processing, but the user can set up parallel processing before calling the function to get speed improvements.
</p>
</div>
</div>

<div id="outline-container-org04035db" class="outline-4">
<h4 id="org04035db"><span class="section-number-4">8.4.4</span> Look for loops, but don't use R base <code>for</code> loops</h4>
<div class="outline-text-4" id="text-8-4-4">
<p>
Base R <code>for</code> loops cannot be used in parallel, because they rely on side effects.
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-orgc156655" class="outline-2">
<h2 id="orgc156655"><span class="section-number-2">9</span> Tricks</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org5dce47c" class="outline-3">
<h3 id="org5dce47c"><span class="section-number-3">9.1</span> Don't forget which computer you are looking at</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Phil Dyer</p>
<p class="date">Created: 2019-07-16 Tue 09:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
